app/views/gossip/display.html.erb

          <a href="/gossips/<%= gossip.id %>" class="card-title">
            <%= gossip.user.first_name %> :
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]