app/controllers/gossip_controller.rb

  def display
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def individual
    @gossip= Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def author
    @user= User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]